results/probe/ds4flash_tp4_b12xmoe_dspark/warmup.log
WARNING 09-02 18:14:14 [import_utils.py:429] Module deep_ep was found but failed to import
WARNING 09-02 18:14:14 [import_utils.py:429] Traceback (most recent call last):
WARNING 09-02 18:14:14 [import_utils.py:429]   File "/usr/local/lib/python3.12/dist-packages/vllm/utils/import_utils.py", line 427, in _has_module
WARNING 09-02 18:14:14 [import_utils.py:429]     importlib.import_module(module_name)
WARNING 09-02 18:14:14 [import_utils.py:429]   File "/usr/lib/python3.12/importlib/__init__.py", line 90, in import_module
WARNING 09-02 18:14:14 [import_utils.py:429]     return _bootstrap._gcd_import(name[level:], package, level)
WARNING 09-02 18:14:14 [import_utils.py:429]            ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
WARNING 09-02 18:14:14 [import_utils.py:429]   File "<frozen importlib._bootstrap>", line 1387, in _gcd_import
WARNING 09-02 18:14:14 [import_utils.py:429]   File "<frozen importlib._bootstrap>", line 1360, in _find_and_load
WARNING 09-02 18:14:14 [import_utils.py:429]   File "<frozen importlib._bootstrap>", line 1331, in _find_and_load_unlocked
WARNING 09-02 18:14:14 [import_utils.py:429]   File "<frozen importlib._bootstrap>", line 935, in _load_unlocked
WARNING 09-02 18:14:14 [import_utils.py:429]   File "<frozen importlib._bootstrap_external>", line 999, in exec_module
WARNING 09-02 18:14:14 [import_utils.py:429]   File "<frozen importlib._bootstrap>", line 488, in _call_with_frames_removed
WARNING 09-02 18:14:14 [import_utils.py:429]   File "/usr/local/lib/python3.12/dist-packages/deep_ep/__init__.py", line 3, in <module>
WARNING 09-02 18:14:14 [import_utils.py:429]     from .utils import EventOverlap
WARNING 09-02 18:14:14 [import_utils.py:429]   File "/usr/local/lib/python3.12/dist-packages/deep_ep/utils.py", line 7, in <module>
WARNING 09-02 18:14:14 [import_utils.py:429]     from deep_ep_cpp import EventHandle
WARNING 09-02 18:14:14 [import_utils.py:429] ImportError: /usr/local/lib/python3.12/dist-packages/deep_ep_cpp.cpython-312-x86_64-linux-gnu.so: undefined symbol: _ZN3c104impl3cow23materialize_cow_storageERNS_11StorageImplE
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x70160b102840>, trust_remote_code=True, seed=7, num_prompts=64, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=64, random_range_ratio='0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=32, model='ds4flash', input_len=None, output_len=None, tokenizer='/workspace/models/DeepSeek-V4-Flash-0731', tokenizer_mode='deepseek_v4', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=True, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, self_timed=None, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-e52e04cf-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 09-02 18:14:14 [config.py:797] Detected quantization_config.scale_fmt=ue8m0; enabling UE8M0 for DeepGEMM.
INFO 09-02 18:14:15 [utils.py:90] Sampling input_len from [1024, 1024] and output_len from [64, 64]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 32
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     64        
Failed requests:                         0         
Maximum request concurrency:             32        
Benchmark duration (s):                  19.09     
Total input tokens:                      65536     
Total generated tokens:                  4096      
Request throughput (req/s):              3.35      
Output token throughput (tok/s):         214.56    
Peak output token throughput (tok/s):    512.00    
Peak concurrent requests:                44.00     
Total token throughput (tok/s):          3647.48   
---------------Time to First Token----------------
Mean TTFT (ms):                          1757.29   
Median TTFT (ms):                        1260.25   
P99 TTFT (ms):                           4793.04   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          119.99    
Median TPOT (ms):                        95.41     
P99 TPOT (ms):                           216.93    
---------------Inter-token Latency----------------
Mean ITL (ms):                           175.54    
Median ITL (ms):                         63.60     
P99 ITL (ms):                            6329.94   
---------------Speculative Decoding---------------
Acceptance rate (%):                     6.82      
Acceptance length:                       1.48      
Drafts:                                  2756      
Draft tokens:                            19292     
Accepted tokens:                         1316      
Per-position acceptance (%):
  Position 0:                            34.47     
  Position 1:                            9.14      
  Position 2:                            2.61      
  Position 3:                            0.83      
  Position 4:                            0.36      
  Position 5:                            0.18      
  Position 6:                            0.15      
==================================================
WARNING 09-02 18:14:40 [import_utils.py:429] Module deep_ep was found but failed to import
WARNING 09-02 18:14:40 [import_utils.py:429] Traceback (most recent call last):
WARNING 09-02 18:14:40 [import_utils.py:429]   File "/usr/local/lib/python3.12/dist-packages/vllm/utils/import_utils.py", line 427, in _has_module
WARNING 09-02 18:14:40 [import_utils.py:429]     importlib.import_module(module_name)
WARNING 09-02 18:14:40 [import_utils.py:429]   File "/usr/lib/python3.12/importlib/__init__.py", line 90, in import_module
WARNING 09-02 18:14:40 [import_utils.py:429]     return _bootstrap._gcd_import(name[level:], package, level)
WARNING 09-02 18:14:40 [import_utils.py:429]            ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
WARNING 09-02 18:14:40 [import_utils.py:429]   File "<frozen importlib._bootstrap>", line 1387, in _gcd_import
WARNING 09-02 18:14:40 [import_utils.py:429]   File "<frozen importlib._bootstrap>", line 1360, in _find_and_load
WARNING 09-02 18:14:40 [import_utils.py:429]   File "<frozen importlib._bootstrap>", line 1331, in _find_and_load_unlocked
WARNING 09-02 18:14:40 [import_utils.py:429]   File "<frozen importlib._bootstrap>", line 935, in _load_unlocked
WARNING 09-02 18:14:40 [import_utils.py:429]   File "<frozen importlib._bootstrap_external>", line 999, in exec_module
WARNING 09-02 18:14:40 [import_utils.py:429]   File "<frozen importlib._bootstrap>", line 488, in _call_with_frames_removed
WARNING 09-02 18:14:40 [import_utils.py:429]   File "/usr/local/lib/python3.12/dist-packages/deep_ep/__init__.py", line 3, in <module>
WARNING 09-02 18:14:40 [import_utils.py:429]     from .utils import EventOverlap
WARNING 09-02 18:14:40 [import_utils.py:429]   File "/usr/local/lib/python3.12/dist-packages/deep_ep/utils.py", line 7, in <module>
WARNING 09-02 18:14:40 [import_utils.py:429]     from deep_ep_cpp import EventHandle
WARNING 09-02 18:14:40 [import_utils.py:429] ImportError: /usr/local/lib/python3.12/dist-packages/deep_ep_cpp.cpython-312-x86_64-linux-gnu.so: undefined symbol: _ZN3c104impl3cow23materialize_cow_storageERNS_11StorageImplE
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x769445d1e020>, trust_remote_code=True, seed=8, num_prompts=256, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=256, random_output_len=32, random_range_ratio='0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=256, model='ds4flash', input_len=None, output_len=None, tokenizer='/workspace/models/DeepSeek-V4-Flash-0731', tokenizer_mode='deepseek_v4', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=True, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, self_timed=None, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-efe50cba-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 09-02 18:14:40 [config.py:797] Detected quantization_config.scale_fmt=ue8m0; enabling UE8M0 for DeepGEMM.
INFO 09-02 18:14:41 [utils.py:90] Sampling input_len from [256, 256] and output_len from [32, 32]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 256
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     256       
Failed requests:                         0         
Maximum request concurrency:             256       
Benchmark duration (s):                  32.91     
Total input tokens:                      65536     
Total generated tokens:                  8192      
Request throughput (req/s):              7.78      
Output token throughput (tok/s):         248.95    
Peak output token throughput (tok/s):    765.00    
Peak concurrent requests:                256.00    
Total token throughput (tok/s):          2240.52   
---------------Time to First Token----------------
Mean TTFT (ms):                          6331.26   
Median TTFT (ms):                        5625.79   
P99 TTFT (ms):                           12624.44  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          632.97    
Median TPOT (ms):                        648.42    
P99 TPOT (ms):                           899.14    
---------------Inter-token Latency----------------
Mean ITL (ms):                           915.82    
Median ITL (ms):                         943.22    
P99 ITL (ms):                            7141.71   
---------------Speculative Decoding---------------
Acceptance rate (%):                     6.73      
Acceptance length:                       1.47      
Drafts:                                  5487      
Draft tokens:                            38409     
Accepted tokens:                         2584      
Per-position acceptance (%):
  Position 0:                            34.08     
  Position 1:                            9.22      
  Position 2:                            2.50      
  Position 3:                            0.78      
  Position 4:                            0.29      
  Position 5:                            0.15      
  Position 6:                            0.07      
==================================================